<a href="https://colab.research.google.com/github/DLPY/PythonSession3/blob/main/Analytics_session_for_session.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Hands-on section

On this notebook we will try to practice some of the concepts and code we have reviewed on this session.

We will take as an example a data set (results.csv) that has 44,341 results of international football matches starting from the very first official match in 1872 up to 2022. The matches range from FIFA World Cup to FIFI Wild Cup to regular friendly matches. The matches are strictly men's full internationals.

Try to answer the questions by writing the code on the next cell available, that you think it is the required. The next cell will have the expected outcome or result that you should come up with, so please, do not run code on that cell, otherwise the result will be lost!

# Some context about the data set

results.csv contains the following columns:


    date - date of the match
    home_team - the name of the home team
    away_team - the name of the away team
    home_score - full-time home team score including extra time
    away_score - full-time away team score including extra time
    tournament - the name of the tournament
    city - the name of the city/town/administrative unit where the match was played
    country - the name of the country where the match was played
    neutral - TRUE/FALSE column indicating whether the match was played at a neutral venue

# Questions

1) Import pandas and numpy and assign them as an alias: pd and np, respectively

2) Import the file results.csv and show its first 5 rows.

NOTE: Don't worry about the location of the file, just write the name results.csv inside the quotes of the function that allows you to import a file

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False

3) Display the data set's information about their data types, memory, range index, etc. and mention the columns that have int64 as their data type

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44353 entries, 0 to 44352
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        44353 non-null  object
 1   home_team   44353 non-null  object
 2   away_team   44353 non-null  object
 3   home_score  44353 non-null  int64
 4   away_score  44353 non-null  int64
 5   tournament  44353 non-null  object
 6   city        44353 non-null  object
 7   country     44353 non-null  object
 8   neutral     44353 non-null  bool
dtypes: bool(1), int64(2), object(6)
memory usage: 2.7+ MB

4) How are you able to quickle get stats like the mean goals scored by the home team and by the away team and their respective standard deviation?

         home_score    away_score
count  44353.000000  44353.000000
mean       1.740559      1.178793
std        1.748722      1.394580
min        0.000000      0.000000
25%        1.000000      0.000000
50%        1.000000      1.000000
75%        2.000000      2.000000
max       31.000000     21.000000

5) Create a new column called total_goals that will have the total goals scored for each match and show the maximum number of goals scored in a single match

31

6) Show the full details of that match that had 31 goals in total

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral,total_goals
24160,2001-04-11,Australia,American Samoa,31,0,FIFA World Cup qualification,Coffs Harbour,Australia,False,31

7) Get the total number of goals scored by England when they have played as the home team

           home_score  away_score  neutral  total_goals
home_team
England          1205         465       56         1670